---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.RotationalLineSpringCoefficient
source: html/e2a38d1f-4cdd-fc02-4b05-644cf6deda2c.htm
---
# Autodesk.Revit.DB.SpecTypeId.RotationalLineSpringCoefficient Property

Rotational Line Spring Coefficient, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId RotationalLineSpringCoefficient { get; }
```